l4es/RealTimeOperatingSystems/NutOS/nut/include/arch/cm3/stm/stm32timertran.h
#elif defined (RCC_APB1ENR_TIM7EN) && defined(RCC_APB1RSTR_TIM7RST) && (STM32TIMER_ID == 7 )
#define STM32TIMER_BASE TIM7_BASE
#define STM32TIMER_MASK RCC_APB1ENR_TIM7EN
#define STM32TIMER_SIG sig_TIM7
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB1ENR_TIM7EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB1RSTR,  _BI32(RCC_APB1RSTR_TIM7RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB1ENR_TIM7EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB1RSTR_TIM7RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB1RSTR_TIM7RST)); } while(0)
#define STM32TIMER_NCH 0

#elif defined (RCC_APB2ENR_TIM8EN) && defined(RCC_APB2RSTR_TIM8RST) && (STM32TIMER_ID == 8 )
#define STM32TIMER_BASE TIM8_BASE
#define STM32TIMER_MASK RCC_APB2ENR_TIM8EN
#define STM32TIMER_SIG sig_TIM8
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM8EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM8RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM8EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM8RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM8RST)); } while(0)
# if defined(RCC_CFGR3_TIM8SW_PLL)
#  define STM32TIMER_SW RCC_CFGR3_TIM8SW_PLL
# endif
#define STM32TIMER_BDTR
#if defined(MCU_STM32F3)
#define STM32TIMER_NCH 6
#else
#define STM32TIMER_NCH 4
#endif
#if defined(MCU_STM32L1) || defined(MCU_STM32F2) || defined(MCU_STM32F4) ||  defined(MCU_STM32F7) || defined(MCU_STM32L4)
#define STM32TIMER_AF(gpio) 3
#elif defined(MCU_STM32F3)
/* FIXME: This doesn't map TIM*_BKIN2 */
#define STM32TIMER_ETR_AF(gpio) (PA00 == gpio)? 10:6
#define STM32TIMER_BKIN_AF(gpio) \
    (PA00 == gpio)? 9:(PA10 == gpio)? 11 : (PB07 == gpio) ? 5 : 4

#define STM32TIMER_AF(gpio) (                           \
        ( PC00 == (gpio & GPIO_PORT_MASK)) ?  4 :       \
        ( PD00 == (gpio & GPIO_PORT_MASK)) ?  4 :       \
        ( PA10 == gpio)                    ?  9 :       \
        ( PA15 == gpio)                    ?  2 :       \
        ( PB05 == gpio)                    ?  3 :       \
        ( PA14 == gpio)                    ?  5 :       \
        ( PB06 == gpio)                    ?  5 :       \
        ( PB07 == gpio)                    ?  5 :       \
        ( PB08 == gpio)                    ? 10 :       \
        ( PB09 == gpio)                    ? 10 :  4)

#else
# warning Illegal pin mapping for TIM8
#endif

#elif defined (RCC_APB2ENR_TIM9EN) && defined(RCC_APB2RSTR_TIM9RST) && (STM32TIMER_ID == 9 )
#define STM32TIMER_BASE TIM9_BASE
#define STM32TIMER_MASK RCC_APB2ENR_TIM9EN
#define STM32TIMER_SIG sig_TIM9
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM9EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM9RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM9EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM9RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM9RST)); } while(0)
#define STM32TIMER_NCH 2
#if defined(MCU_STM32L1) || defined(MCU_STM32F2) || defined(MCU_STM32F4) || defined(MCU_STM32F7)
#define STM32TIMER_AF(gpio) 3
#elif defined(MCU_STM32F1)
#define STM32TIMER_REMAP_REG   AFIO->MAPR2
#define STM32TIMER_REMAP_MASK  AFIO_MAPR2_TIM9_REMAP
#define STM32TIMER_REMAP_SHIFT (_BI32(AFIO_MAPR2_TIM9_REMAP))
#define STM32TIMER_REMAP_VALUE STM32F1_TIM9_REMAP
#else
# warning Illegal pin mapping for TIM9
#endif

#elif defined (RCC_APB2ENR_TIM10EN) && defined(RCC_APB2RSTR_TIM10RST) && (STM32TIMER_ID == 10 )
#define STM32TIMER_BASE TIM10_BASE
#define STM32TIMER_MASK RCC_APB2ENR_TIM10EN
#define STM32TIMER_SIG sig_TIM10
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM10EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM10RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM10EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM10RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM10RST)); } while(0)
#define STM32TIMER_NCH 1
#if defined(MCU_STM32L1) || defined(MCU_STM32F2) || defined(MCU_STM32F4)|| defined(MCU_STM32F7)
#define STM32TIMER_AF(gpio) 3
#elif defined(MCU_STM32F1)
#define STM32TIMER_REMAP_REG   AFIO->MAPR2
#define STM32TIMER_REMAP_MASK  AFIO_MAPR2_TIM10_REMAP
#define STM32TIMER_REMAP_SHIFT (_BI32(AFIO_MAPR2_TIM10_REMAP))
#define STM32TIMER_REMAP_VALUE STM32F1_TIM10_REMAP
#else
# warning Illegal pin mapping for TIM10
#endif

#elif defined (RCC_APB2ENR_TIM11EN) && defined(RCC_APB2RSTR_TIM11RST) && (STM32TIMER_ID == 11 )
#define STM32TIMER_BASE TIM11_BASE
#define STM32TIMER_MASK RCC_APB2ENR_TIM11EN
#define STM32TIMER_SIG sig_TIM11
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM11EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM11RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB2ENR_TIM11EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB2RSTR_TIM11RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB2RSTR_TIM11RST)); } while(0)
#define STM32TIMER_NCH 1
#if defined(MCU_STM32L1) || defined(MCU_STM32F2) || defined(MCU_STM32F4) || defined(MCU_STM32F7)
#define STM32TIMER_AF(gpio) 3
#elif defined(MCU_STM32F1)
#define STM32TIMER_REMAP_REG   AFIO->MAPR2
#define STM32TIMER_REMAP_MASK  AFIO_MAPR2_TIM11_REMAP
#define STM32TIMER_REMAP_SHIFT (_BI32(AFIO_MAPR2_TIM11_REMAP))
#define STM32TIMER_REMAP_VALUE STM32F1_TIM11_REMAP
#else
# warning Illegal pin mapping for TIM11
#endif

#elif defined (RCC_APB1ENR_TIM12EN) && defined(RCC_APB1RSTR_TIM12RST) && (STM32TIMER_ID == 12)
#define STM32TIMER_BASE TIM12_BASE
#define STM32TIMER_MASK RCC_APB1ENR_TIM12EN
#define STM32TIMER_SIG sig_TIM12
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB1ENR_TIM12EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB1RSTR,  _BI32(RCC_APB1RSTR_TIM12RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB1ENR_TIM12EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB1RSTR_TIM12RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB1RSTR_TIM12RST)); } while(0)
#define STM32TIMER_NCH 2
#if defined(MCU_STM32L1) || defined(MCU_STM32F2) || defined(MCU_STM32F4) || defined(MCU_STM32F7)
#define STM32TIMER_AF(gpio) 9
#elif defined(MCU_STM32F37)
#define STM32TIMER_AF(gpio) ((PB00 == (gpio & GPIO_PORT_MASK)) ?  9 : 10)
#elif defined(MCU_STM32F1)
#define STM32TIMER_REMAP_REG   AFIO->MAPR2
#define STM32TIMER_REMAP_MASK  AFIO_MAPR2_TIM12_REMAP
#define STM32TIMER_REMAP_SHIFT (_BI32(AFIO_MAPR2_TIM12_REMAP))
#define STM32TIMER_REMAP_VALUE STM32F1_TIM12_REMAP
#else
# warning Illegal pin mapping for TIM12
#endif

#elif defined (RCC_APB1ENR_TIM13EN) && defined(RCC_APB1RSTR_TIM13RST) && (STM32TIMER_ID == 13 )
#define STM32TIMER_BASE TIM13_BASE
#define STM32TIMER_MASK RCC_APB1ENR_TIM13EN
#define STM32TIMER_SIG sig_TIM13
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB1ENR_TIM13EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB1RSTR,  _BI32(RCC_APB1RSTR_TIM13RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB1ENR_TIM13EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB1RSTR_TIM13RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB1RSTR_TIM13RST)); } while(0)
#define STM32TIMER_NCH 1
#if defined(MCU_STM32L1) || defined(MCU_STM32F2) || defined(MCU_STM32F4) || defined(MCU_STM32F7)
#define STM32TIMER_AF(gpio) 9
#elif defined(MCU_STM32F1)
#define STM32TIMER_REMAP_REG   AFIO->MAPR2
#define STM32TIMER_REMAP_MASK  AFIO_MAPR2_TIM13_REMAP
#define STM32TIMER_REMAP_SHIFT (_BI32(AFIO_MAPR2_TIM13_REMAP))
#define STM32TIMER_REMAP_VALUE STM32F1_TIM13_REMAP
#else
# warning Illegal pin mapping for TIM13
#endif

#elif defined (RCC_APB1ENR_TIM14EN) && defined(RCC_APB1RSTR_TIM14RST) && (STM32TIMER_ID == 14 )
#define STM32TIMER_BASE TIM14_BASE
#define STM32TIMER_MASK RCC_APB1ENR_TIM14EN
#define STM32TIMER_SIG sig_TIM14
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB1ENR_TIM14EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB1RSTR,  _BI32(RCC_APB1RSTR_TIM14RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB1ENR_TIM14EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB1RSTR_TIM14RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB1RSTR_TIM14RST)); } while(0)
#define STM32TIMER_NCH 1
#if defined(MCU_STM32L1) || defined(MCU_STM32F2) || defined(MCU_STM32F4) || defined(MCU_STM32F7)
#define STM32TIMER_AF(gpio) 9
#elif defined(MCU_STM32F37)
#define STM32TIMER_AF(gpio) ((PF00 == (gpio & GPIO_PORT_MASK))? 2: 9)
#elif defined (MCU_STM32F0)
#define STM32TIMER_AF(gpio)  ((PF00 == (gpio & GPIO_PORT_MASK))? 4: 0)
#elif defined(MCU_STM32F1)
#define STM32TIMER_REMAP_REG   AFIO->MAPR2
#define STM32TIMER_REMAP_MASK  AFIO_MAPR2_TIM14_REMAP
#define STM32TIMER_REMAP_SHIFT (_BI32(AFIO_MAPR2_TIM14_REMAP))
#define STM32TIMER_REMAP_VALUE STM32F1_TIM14_REMAP
#else
# warning Illegal pin mapping for TIM14
#endif

