l4es/RealTimeOperatingSystems/NutOS/nut/include/arch/cm3/stm/stm32timertran.h
#elif defined (RCC_APB2ENR_TIM15EN) && defined(RCC_APB2RSTR_TIM15RST) && (STM32TIMER_ID == 15 )
#define STM32TIMER_BASE TIM15_BASE
#define STM32TIMER_MASK RCC_APB2ENR_TIM15EN
#define STM32TIMER_SIG sig_TIM15
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM15EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM15RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM15EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM15RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM15RST)); } while(0)
# if defined(RCC_CFGR3_TIM15SW_PLL)
#  define STM32TIMER_SW RCC_CFGR3_TIM15SW_PLL
# endif
#define STM32TIMER_NCH 2
#define STM32TIMER_BDTR
/* F3: PA1/CH1N/AF9, PA2/CH1/AF9, PA3/CH2/AF9 PA9/BKIN/AF9
   F30: PB14/CH1/AF1, PB15/CH2/AF1, PB15/CH1_N/AF2, PF9/CH1/AF3, PF10/CH2/AF3
   F37: PB4/CH1_N/AF9, PB6/CH1/AF9, PB7/CH1/AF9, PB14/CH1/AF1, PB15/CH2/AF1
   FIXME: This doesn't map TIM15 CH1N
*/
#if defined(MCU_STM32F3)
# if defined(MCU_STM32F37)
#  define STM32TIMER_AF(gpio) ((PB14 == gpio) ||(PB15 == gpio))? 1 :9
# else
#  define STM32TIMER_AF(gpio) (                   \
        (PF00 == (gpio & GPIO_PORT_MASK))? 3 :    \
        (PB00 == (gpio & GPIO_PORT_MASK))? 1 : 9 )
# endif
#elif defined (MCU_STM32F0)
#define STM32TIMER_AF(gpio) (  \
    (PA01 == gpio)? 5 :        \
    (PA11 == gpio)? 5 :        \
    (PB11 == gpio)? 1 : 0)
/* PB13 as TIM15_CH1N not handled here !*/
#elif defined(MCU_STM32L4)
#  define STM32TIMER_AF(gpio) 14
#elif defined(MCU_STM32F1)
#define STM32TIMER_REMAP_REG   AFIO->MAPR2
#define STM32TIMER_REMAP_MASK  AFIO_MAPR2_TIM15_REMAP
#define STM32TIMER_REMAP_SHIFT (_BI32(AFIO_MAPR2_TIM15_REMAP))
#define STM32TIMER_REMAP_VALUE STM32F1_TIM15_REMAP
#else
# warning Illegal pin mapping for TIM15
#endif

#elif defined (RCC_APB2ENR_TIM16EN) && defined(RCC_APB2RSTR_TIM16RST) && (STM32TIMER_ID == 16 )
#define STM32TIMER_BASE TIM16_BASE
#define STM32TIMER_MASK RCC_APB2ENR_TIM16EN
#define STM32TIMER_SIG sig_TIM16
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM16EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM16RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM16EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM16RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM16RST)); } while(0)
# if defined(RCC_CFGR3_TIM16SW_PLL)
#  define STM32TIMER_SW RCC_CFGR3_TIM16SW_PLL
# endif
#define STM32TIMER_NCH 1
#define STM32TIMER_BDTR
#if defined(MCU_STM32F3)
# define STM32TIMER_AF(gpio) ((PE00 == (gpio & GPIO_PORT_MASK) )? 4 :  1)
#elif defined(MCU_STM32L4)
# define STM32TIMER_AF(gpio) 14
#elif defined(MCU_STM32F1)
#define STM32TIMER_REMAP_REG   AFIO->MAPR2
#define STM32TIMER_REMAP_MASK  AFIO_MAPR2_TIM16_REMAP
#define STM32TIMER_REMAP_SHIFT (_BI32(AFIO_MAPR2_TIM16_REMAP))
#define STM32TIMER_REMAP_VALUE STM32F1_TIM16_REMAP
#else
# warning Illegal pin mapping for TIM16
#endif

#elif defined (RCC_APB2ENR_TIM17EN) && defined(RCC_APB2RSTR_TIM17RST) && (STM32TIMER_ID == 17 )
#define STM32TIMER_BASE TIM17_BASE
#define STM32TIMER_MASK RCC_APB2ENR_TIM17EN
#define STM32TIMER_SIG sig_TIM17
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM17EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM17RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM17EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM17RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB2RSTR, _BI32(RCC_APB2RSTR_TIM17RST)); } while(0)
# if defined(RCC_CFGR3_TIM17SW_PLL)
#  define STM32TIMER_SW RCC_CFGR3_TIM17SW_PLL
# endif
#define STM32TIMER_NCH 1
#define STM32TIMER_BDTR
#if defined(MCU_STM32F3)
# if defined(MCU_STM32F37)
#  define STM32TIMER_AF(gpio) (                     \
        (PA00 == (gpio & GPIO_PORT_MASK))?  1:      \
        (PB07 == gpio)                   ?  1:      \
        (PB09 == gpio)                   ?  1:      \
        (PB04 == gpio)                   ? 10:      \
        (PB05 == gpio)                   ? 10: 1)
# else
#  define STM32TIMER_AF(gpio) (                     \
        (PE00 == (gpio & GPIO_PORT_MASK))?  4:      \
        (PA00 == (gpio & GPIO_PORT_MASK))?  1:      \
        (PB07 == gpio)                   ?  1:      \
        (PB09 == gpio)                   ?  1:      \
        (PA04 == gpio)                   ? 10:      \
        (PA05 == gpio)                   ? 10: 1)
# endif
#elif defined(MCU_STM32L4)
# define STM32TIMER_AF(gpio) 14
#elif defined (MCU_STM32F0)
#define STM32TIMER_AF(gpio) (                  \
    (PA00 == (gpio & GPIO_PORT_MASK))?  5:     \
    (PB00 == (gpio & GPIO_PORT_MASK))?  2: 0)
#elif defined(MCU_STM32F1)
#define STM32TIMER_REMAP_REG   AFIO->MAPR2
#define STM32TIMER_REMAP_MASK  AFIO_MAPR2_TIM17_REMAP
#define STM32TIMER_REMAP_SHIFT (_BI32(AFIO_MAPR2_TIM17_REMAP))
#define STM32TIMER_REMAP_VALUE STM32F1_TIM17_REMAP
#else
# warning Illegal pin mapping for TIM17
#endif

#elif defined (RCC_APB2ENR_TIM18EN) && defined(RCC_APB2RSTR_TIM18RST) && (STM32TIMER_ID == 18 )
#define STM32TIMER_BASE TIM18_BASE
#define STM32TIMER_MASK RCC_APB2ENR_TIM18EN
#define STM32TIMER_SIG sig_TIM18
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB1ENR_TIM18EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB1RSTR,  _BI32(RCC_APB1RSTR_TIM18RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB1ENR_TIM18EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB1RSTR_TIM18RST)); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB1RSTR_TIM18RST)); } while(0)
#define STM32TIMER_NCH 0

#elif defined (RCC_APB2ENR_TIM20EN) && defined(RCC_APB2RSTR_TIM20RST) && (STM32TIMER_ID == 20 )
#define STM32TIMER_BASE TIM20_BASE
#define STM32TIMER_SIG sig_TIM20
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM20EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM20RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB2ENR_TIM20EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB2RSTR_TIM20RST); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB2RSTR_TIM20RST)); } while(0)
# if defined(RCC_CFGR3_TIM20SW_PLL)
#  define STM32TIMER_SW RCC_CFGR3_TIM20SW_PLL
# endif
#define STM32TIMER_NCH 6
#define STM32TIMER_AF(gpio) ((PF04 == gpio)? 3 : (PE00 == (gpio & GPIO_PORT_MASK) )?  6 : 2)

#elif defined (RCC_APB2ENR_TIM19EN) && defined(RCC_APB2RSTR_TIM19RST) && (STM32TIMER_ID == 19 )
#define STM32TIMER_BASE TIM19_BASE
#define STM32TIMER_SIG sig_TIM19
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM19EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM19RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB2ENR_TIM19EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB2RSTR_TIM19RST); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB2RSTR_TIM19RST)); } while(0)
#define STM32TIMER_NCH 4
#define STM32TIMER_AF(gpio) (                           \
        (PC00 == (gpio & GPIO_PORT_MASK) )?  2 :         \
        (PD00 == (gpio & GPIO_PORT_MASK) )?  2 : 11)

/* Only on L0  as of June 2015 */
#elif defined (RCC_APB2ENR_TIM21EN) && defined(RCC_APB2RSTR_TIM21RST) && (STM32TIMER_ID == 21 )
#define STM32TIMER_BASE TIM21_BASE
#define STM32TIMER_MASK RCC_APB2ENR_TIM21EN
#define STM32TIMER_SIG sig_TIM21
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM21EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM21RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB2ENR_TIM21EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB2RSTR_TIM21RST); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB2RSTR_TIM21RST)); } while(0)
#define STM32TIMER_NCH 2
#define STM32TIMER_AF(gpio) (                   \
        (PB00 == (gpio & GPIO_PORT_MASK) )?  6 : \
        (PA00 == (gpio & GPIO_PORT_MASK) )?  5 : 0 )

/* Only on L0  as of June 2015 */
#elif defined (RCC_APB2ENR_TIM22EN) && defined(RCC_APB2RSTR_TIM22RST) && (STM32TIMER_ID == 22 )
#define STM32TIMER_BASE TIM22_BASE
#define STM32TIMER_MASK RCC_APB2ENR_TIM22EN
#define STM32TIMER_SIG sig_TIM22
#define STM32TIMER_CLK() CM3BBSET(RCC_BASE, RCC_TypeDef, APB2ENR,  _BI32(RCC_APB2ENR_TIM22EN))
#define STM32TIMER_RST() CM3BBPULSE(RCC_BASE, RCC_TypeDef, APB2RSTR,  _BI32(RCC_APB2RSTR_TIM22RST))
#define STM32TIMER_INIT() do{                                           \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1ENR,  _BI32(RCC_APB2ENR_TIM22EN)); \
        CM3BBSET(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB2RSTR_TIM22RST); \
        CM3BBCLR(RCC_BASE, RCC_TypeDef, APB1RSTR, _BI32(RCC_APB2RSTR_TIM22RST)); } while(0)
#define STM32TIMER_NCH 2
#define STM32TIMER_AF(gpio) ((PC00 == (gpio & GPIO_PORT_MASK))? 0 : 4)

#else
#warning No match
#endif

#define STM32TIMER ((TIM_TypeDef*)STM32TIMER_BASE)

/* Only few timers are 32 bit. Use this "catch all else" to reduce duplication*/
#if !defined(STM32TIMER_WIDTH)
#define STM32TIMER_WIDTH 16
#endif

/* For F1 we need STM32TIMER_AF() defined, but the value is don't care. */
#if !defined(STM32TIMER_AF)
#define STM32TIMER_AF(gpio) 0
#endif

/* Allow finer grained AF */
#if !defined(STM32TIMER_ETR_AF)
# define STM32TIMER_ETR_AF(gpio) STM32TIMER_AF(gpio)
#endif
#if !defined(STM32TIMER_CH1_AF)
# define STM32TIMER_CH1_AF(gpio) STM32TIMER_AF(gpio)
#endif
#if !defined(STM32TIMER_BKIN_AF)
# define STM32TIMER_BKIN_AF(gpio) STM32TIMER_AF(gpio)
#endif
